pyocd/pyOCD/pyocd/debug/svd/data/HC32F160.svd
                <register>
                    <name>EIRQCR8</name>
                    <description>desc EIRQCR8</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR9</name>
                    <description>desc EIRQCR9</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR10</name>
                    <description>desc EIRQCR10</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR11</name>
                    <description>desc EIRQCR11</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WUPENR</name>
                    <description>desc WUPENR</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1C70FFF</resetMask>
                    <fields>
                        <field>
                            <name>EIRQWUEN</name>
                            <description>desc EIRQWUEN</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDTWUEN</name>
                            <description>desc SWDTWUEN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EKEYWUEN</name>
                            <description>desc EKEYWUEN</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0CMPWUEN</name>
                            <description>desc TMR0CMPWUEN</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVDWUEN</name>
                            <description>desc PVDWUEN</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCALMWUEN</name>
                            <description>desc RTCALMWUEN</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCPRDWUEN</name>
                            <description>desc RTCPRDWUEN</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQFR</name>
                    <description>desc EIRQFR</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>EIRQF</name>
                            <description>desc EIRQF</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCLR</name>
                    <description>desc EIRQCLR</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>EIRQCL</name>
                            <description>desc EIRQCL</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR8</name>
                    <description>desc ISELR8</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR9</name>
                    <description>desc ISELR9</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR10</name>
                    <description>desc ISELR10</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR11</name>
                    <description>desc ISELR11</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR12</name>
                    <description>desc ISELR12</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR13</name>
                    <description>desc ISELR13</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR14</name>
                    <description>desc ISELR14</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR15</name>
                    <description>desc ISELR15</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR16</name>
                    <description>desc ISELR16</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR17</name>
                    <description>desc ISELR17</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR18</name>
                    <description>desc ISELR18</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR19</name>
                    <description>desc ISELR19</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR20</name>
                    <description>desc ISELR20</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR21</name>
                    <description>desc ISELR21</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR22</name>
                    <description>desc ISELR22</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR23</name>
                    <description>desc ISELR23</description>
                    <addressOffset>0xDC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR24</name>
                    <description>desc ISELR24</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFE</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>15</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISELR25</name>
                    <description>desc ISELR25</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFE</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>15</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
